RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/inc/hc32_ll_usb.h
/**
 *******************************************************************************
 * @file  hc32_ll_usb.h
 * @brief A detailed description is available at hardware registers
 @verbatim
   Change Logs:
   Date             Author          Notes
   2022-03-31       CDT             First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */
#ifndef __HC32_LL_USB_H__
#define __HC32_LL_USB_H__

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C"
{
#endif

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_def.h"

#include "hc32f4xx.h"
#include "hc32f4xx_conf.h"

#include "usb_app_conf.h"

/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @addtogroup LL_USB
 * @{
 */

#if (LL_USB_ENABLE == DDL_ON)

/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
#define USB_MAX_TX_FIFOS                       (12U)
#define USB_MAX_CH_NUM                         (USB_MAX_TX_FIFOS)
#define USB_MAX_EP_NUM                         (6U)

#define USB_MAX_EP0_SIZE                       (64U)
/* working mode of the USB core */
#define DEVICE_MODE                            (0U)
#define HOST_MODE                              (1U)

/* Macro definations for device mode*/
#define DSTS_ENUMSPD_HS_PHY_30MHZ_OR_60MHZ     (0U << USBFS_DSTS_ENUMSPD_POS)
#define DSTS_ENUMSPD_FS_PHY_30MHZ_OR_60MHZ     (1U << USBFS_DSTS_ENUMSPD_POS)
#define DSTS_ENUMSPD_LS_PHY_6MHZ               (2U << USBFS_DSTS_ENUMSPD_POS)
#define DSTS_ENUMSPD_FS_PHY_48MHZ              (3U << USBFS_DSTS_ENUMSPD_POS)

/* EP type */
#define EP_TYPE_CTRL                           (0U)
#define EP_TYPE_ISOC                           (1U)
#define EP_TYPE_BULK                           (2U)
#define EP_TYPE_INTR                           (3U)
#define EP_TYPE_MSK                            (3U)

/* USB port speed */
#define PRTSPD_FULL_SPEED                      (1U)
#define PRTSPD_LOW_SPEED                       (2U)

/* PHY clock */
#define HCFG_30_60_MHZ                         (0U)
#define HCFG_48_MHZ                            (1U)
#define HCFG_6_MHZ                             (2U)

#define USB_EP_TX_DIS                          (0x0000U)
#define USB_EP_TX_STALL                        (0x0010U)
#define USB_EP_TX_NAK                          (0x0020U)
#define USB_EP_TX_VALID                        (0x0030U)

#define USB_EP_RX_DIS                          (0x0000U)
#define USB_EP_RX_STALL                        (0x1000U)
#define USB_EP_RX_NAK                          (0x2000U)
#define USB_EP_RX_VALID                        (0x3000U)

#define USB_OK                              (0U)
#define USB_ERROR                           (1U)

#define USB_FRAME_INTERVAL_80                  (0UL << USBFS_DCFG_PFIVL_POS)
#define USB_FRAME_INTERVAL_85                  (1UL << USBFS_DCFG_PFIVL_POS)
#define USB_FRAME_INTERVAL_90                  (2UL << USBFS_DCFG_PFIVL_POS)
#define USB_FRAME_INTERVAL_95                  (3UL << USBFS_DCFG_PFIVL_POS)

#define SWAPBYTE(addr)          (((uint16_t)(*((uint8_t *)(addr)))) + \
                                (uint16_t)(((uint16_t)(*(((uint8_t *)(addr)) + 1U))) << 8U))
#define LOBYTE(x)               ((uint8_t)((uint16_t)(x) & 0x00FFU))
#define HIBYTE(x)               ((uint8_t)(((uint16_t)(x) & 0xFF00U) >>8U))

#ifdef USB_INTERNAL_DMA_ENABLED
#define __USB_ALIGN_END
#if defined   (__GNUC__)      /* GNU Compiler */
#define __USB_ALIGN_BEGIN       __attribute__ ((aligned (4)))
#elif defined   (__CC_ARM)    /* ARM Compiler */
#define __USB_ALIGN_BEGIN       __align(4)
#elif defined (__ICCARM__)    /* IAR Compiler */
#define __USB_ALIGN_BEGIN
#elif defined  (__TASKING__)  /* TASKING Compiler */
#define __USB_ALIGN_BEGIN       __align(4)
#endif
#else
#define __USB_ALIGN_BEGIN
#define __USB_ALIGN_END
#endif

/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/

typedef struct {
    __IO uint32_t GVBUSCFG;                   /* VBUS Configuration Register                      000h */
    uint32_t Reserved04;                      /* Reserved                                         004h */
    __IO uint32_t GAHBCFG;                    /* AHB Configuration Register                       008h */
    __IO uint32_t GUSBCFG;                    /* USB Configuration Register                       00Ch */
    __IO uint32_t GRSTCTL;                    /* Reset Register                                   010h */
    __IO uint32_t GINTSTS;                    /* Interrupt Register                               014h */
    __IO uint32_t GINTMSK;                    /* Interrupt Mask Register                          018h */
    __IO uint32_t GRXSTSR;                    /* Receive Sts Q Read Register                      01Ch */
    __IO uint32_t GRXSTSP;                    /* Receive Sts Q Read & POP Register                020h */
    __IO uint32_t GRXFSIZ;                    /* Receive FIFO Size Register                       024h */
    __IO uint32_t HNPTXFSIZ;                  /* HNPTXFSIZ: Host Non-Periodic Transmit FIFO Size Register 028h */
                                              /* DIEPTXF0: Device IN EP0 Transmit FIFO size register      028h */
    __IO uint32_t HNPTXSTS;                   /* Host Non Periodic Transmit FIFO/Queue Status Register    02Ch */
    uint32_t Reserved30[3];                   /* Reserved                                    030h-038h */
    __IO uint32_t CID;                        /* User ID Register                                 03Ch */
    uint32_t  Reserved40[5];                  /* Reserved                                    040h-050h */
    __IO uint32_t GLPMCFG;                    /* Low Power Mode Configuration Register            054h */
    uint32_t  Reserved58[42];                 /* Reserved                                    058h-0FCh */
    __IO uint32_t HPTXFSIZ;                   /* Host Periodic Transmit FIFO Size Register        100h */
    __IO uint32_t DIEPTXF[USB_MAX_TX_FIFOS];  /* Device Periodic Transmit FIFO Size Register           */
} USB_CORE_GREGS;

