RT-Thread/rt-thread/bsp/hc32/libraries/hc32f460_ddl/drivers/hc32_ll_driver/inc/hc32_ll_usb.h
typedef struct {
    __IO uint32_t DCFG;         /* Device Configuration Register                     800h */
    __IO uint32_t DCTL;         /* Device Control Register                           804h */
    __IO uint32_t DSTS;         /* Device Status Register (RO)                       808h */
    uint32_t Reserved0C;        /* Reserved                                          80Ch */
    __IO uint32_t DIEPMSK;      /* Device IN EP Common Interrupt Mask Register       810h */
    __IO uint32_t DOEPMSK;      /* Device OUT EP Common Interrupt Mask Register      814h */
    __IO uint32_t DAINT;        /* Device All EP Interrupt Register                  818h */
    __IO uint32_t DAINTMSK;     /* Device All EP Interrupt Mask Register             81Ch */
    uint32_t Reserved20[4];     /* Reserved                                     820h-82Ch */
    __IO uint32_t DTHRCTL;      /* Device Threshold Control Register                 830h */
    __IO uint32_t DIEPEMPMSK;   /* Device IN EP FIFO Empty Interrupt Mask Register   834h */
    __IO uint32_t DEACHINT;     /* Deivce Each EP Interrupt Register                 838h */
    __IO uint32_t DEACHINTMSK;  /* Device Each EP Interrupt Mask Register            83Ch */
    uint32_t Reserved40;        /* Reserved                                          840h */
    __IO uint32_t DIEPEACHMSK1; /* Deveice IN EP1 Interrupt Mask Register            844h */
    uint32_t Reserved48[15];     /* Reserved                                      848-880h */
    __IO uint32_t DOEPEACHMSK1; /* Deveice OUT EP1 Interrupt Mask Register           884h */
} USB_CORE_DREGS;

typedef struct {
    __IO uint32_t DIEPCTL;  /* dev IN Endpoint Control Reg 900h + (ep_num * 20h) + 00h     */
    uint32_t Reserved04;        /* Reserved                    900h + (ep_num * 20h) + 04h */
    __IO uint32_t DIEPINT;  /* dev IN Endpoint Itr Reg     900h + (ep_num * 20h) + 08h     */
    uint32_t Reserved0C;        /* Reserved                    900h + (ep_num * 20h) + 0Ch */
    __IO uint32_t DIEPTSIZ; /* IN Endpoint Txfer Size      900h + (ep_num * 20h) + 10h     */
    __IO uint32_t DIEPDMA;  /* IN Endpoint DMA Address Reg 900h + (ep_num * 20h) + 14h     */
    __IO uint32_t DTXFSTS;  /* IN Endpoint Tx FIFO Status  900h + (ep_num * 20h) + 18h     */
    uint32_t Reserved18;        /* Reserved                    900h+(ep_num*20h)+1Ch-900h+ (ep_num * 20h) + 1Ch*/
} USB_CORE_INEPREGS;

typedef struct {
    __IO uint32_t DOEPCTL;   /* dev OUT Endpoint Control Reg  B00h + (ep_num * 20h) + 00h */
    uint32_t Reserved04;     /* Reserved                      B00h + (ep_num * 20h) + 04h */
    __IO uint32_t DOEPINT;   /* dev OUT Endpoint Itr Reg      B00h + (ep_num * 20h) + 08h */
    uint32_t Reserved0C;     /* Reserved                      B00h + (ep_num * 20h) + 0Ch */
    __IO uint32_t DOEPTSIZ;  /* dev OUT Endpoint Txfer Size   B00h + (ep_num * 20h) + 10h */
    __IO uint32_t DOEPDMA;   /* dev OUT Endpoint DMA Address  B00h + (ep_num * 20h) + 14h */
    uint32_t Reserved18[2];  /* Reserved                B00h + (ep_num * 20h) + 18h - B00h + (ep_num * 20h) + 1Ch */
} USB_CORE_OUTEPREGS;

typedef struct {
    __IO uint32_t HCFG;      /* Host Configuration Register    400h*/
    __IO uint32_t HFIR;      /* Host Frame Interval Register   404h*/
    __IO uint32_t HFNUM;     /* Host Frame Nbr/Frame Remaining 408h*/
    uint32_t Reserved40C;    /* Reserved                       40Ch*/
    __IO uint32_t HPTXSTS;   /* Host Periodic Tx FIFO/ Queue Status 410h*/
    __IO uint32_t HAINT;     /* Host All Channels Interrupt Register 414h*/
    __IO uint32_t HAINTMSK;  /* Host All Channels Interrupt Mask 418h*/
} USB_CORE_HREGS;

typedef struct {
    __IO uint32_t HCCHAR;
    __IO uint32_t HCSPLT;
    __IO uint32_t HCINT;
    __IO uint32_t HCINTMSK;
    __IO uint32_t HCTSIZ;
    __IO uint32_t HCDMA;
    uint32_t Reserved[2];
} USB_CORE_HC_REGS;

typedef struct { /* 000h */
    USB_CORE_GREGS     *GREGS;
    USB_CORE_DREGS     *DREGS;
    USB_CORE_HREGS     *HREGS;
    USB_CORE_INEPREGS  *INEP_REGS[USB_MAX_TX_FIFOS];
    USB_CORE_OUTEPREGS *OUTEP_REGS[USB_MAX_TX_FIFOS];
    USB_CORE_HC_REGS   *HC_REGS[USB_MAX_TX_FIFOS];
    __IO uint32_t  *HPRT;
    __IO uint32_t  *DFIFO[USB_MAX_TX_FIFOS];
    __IO uint32_t  *GCCTL;
} LL_USB_TypeDef;

typedef struct {
    uint8_t       host_chnum;
    uint8_t       dev_epnum;
    uint8_t       dmaen;
    uint8_t       low_power;
    uint8_t       phy_type;
    uint8_t       core_type;
} USB_CORE_BASIC_CFGS;

typedef struct {
    uint8_t       dev_addr;
    uint8_t       ep_idx;
    uint8_t       is_epin;
    uint8_t       ch_speed;
    uint8_t       do_ping;
    uint8_t       ep_type;
    uint16_t      max_packet;
    uint8_t       pid_type;
    uint8_t       in_toggle;
    uint8_t       out_toggle;
    /* transaction level variables*/
    uint32_t      dma_addr;
    uint32_t      xfer_len;
    uint32_t      xfer_count;
    uint8_t       *xfer_buff;
} USB_HOST_CH;

typedef struct {
    uint8_t        epidx;
    uint8_t        ep_dir;
    uint8_t        trans_type;
    uint8_t        ep_stall;
    uint8_t        data_pid_start;
    uint8_t        datax_pid;
    uint16_t       tx_fifo_num;
    uint32_t       maxpacket;
    /* Transfer level variables */
    uint32_t       rem_data_len;
    uint32_t       total_data_len;
    uint32_t       ctl_data_len;
    /* transaction level variables*/
    uint32_t       dma_addr;
    uint32_t       xfer_len;
    uint32_t       xfer_count;
    uint8_t        *xfer_buff;
} USB_DEV_EP;

/*******************************************************************************
  Global function prototypes (definition in C source)
 ******************************************************************************/

/**
 * @addtogroup USB_Global_Functions
 * @{
 */

/**
 * @brief  get the current mode of the usb core from the corresponding register
 * @param  [in] USBx        usb instance
 * @retval current mode     1: host mode   0: device mode
 */
__STATIC_INLINE uint8_t usb_getcurmod(LL_USB_TypeDef *USBx)
{
    if (0UL != READ_REG32_BIT(USBx->GREGS->GINTSTS, USBFS_GINTSTS_CMOD)) {
        return 1U;
    } else {
        return 0U;
    }
}

/**
 * @brief  Initializes the normal interrupts
 * @param  [in] USBx        usb instance
 * @retval None
 */
__STATIC_INLINE void usb_normalinten(LL_USB_TypeDef *USBx)
{
    WRITE_REG32(USBx->GREGS->GINTSTS, 0xBFFFFFFFUL);
    WRITE_REG32(USBx->GREGS->GINTMSK, USBFS_GINTMSK_WKUIM | USBFS_GINTMSK_USBSUSPM);
}

/**
 * @brief  clear all the pending device interrupt bits and mask the IN and OUT
 *         endpoint interrupts.
 * @param  [in] USBx        usb instance
 * @retval None
 */
__STATIC_INLINE void usb_clrandmskepint(LL_USB_TypeDef *USBx)
{
    WRITE_REG32(USBx->DREGS->DIEPMSK, 0UL);
    WRITE_REG32(USBx->DREGS->DOEPMSK, 0UL);
    WRITE_REG32(USBx->DREGS->DAINT, 0xFFFFFFFFUL);
    WRITE_REG32(USBx->DREGS->DAINTMSK, 0UL);
}

/**
 * @brief  generate a device connect signal to the USB host
 * @param  [in] USBx        usb instance
 * @retval None
 */
__STATIC_INLINE void usb_coreconn(LL_USB_TypeDef *USBx)
{
    CLR_REG32_BIT(USBx->DREGS->DCTL, USBFS_DCTL_SDIS);
}

/**
 * @brief  test of mode processing
 * @param  [in] USBx        usb instance
 * @param  [in] reg         Register write
 * @retval None
 */
__STATIC_INLINE void usb_runtestmode(LL_USB_TypeDef *USBx, uint32_t reg)
{
    WRITE_REG32(USBx->DREGS->DCTL, reg);
}

/**
 * @brief  Enables the controller's Global interrupts in the AHB Configuration
 *         registers.
 * @param  [in] USBx        usb instance
 * @retval None
 */
__STATIC_INLINE void usb_ginten(LL_USB_TypeDef *USBx)
{
    SET_REG32_BIT(USBx->GREGS->GAHBCFG, USBFS_GAHBCFG_GINTMSK);
}

/**
 * @brief  Disable the controller's Global interrupt in the AHB Configuration
 *         register.
 * @param  [in] USBx        usb instance
 * @retval None
 */
__STATIC_INLINE void usb_gintdis(LL_USB_TypeDef *USBx)
{
    CLR_REG32_BIT(USBx->GREGS->GAHBCFG, USBFS_GAHBCFG_GINTMSK);
}

/**
 * @brief  Get the Core Interrupt bits from the interrupt register not including
 *         the bits that are masked.
 * @param  [in] USBx        usb instance
 * @retval status[32bits]
 */
__STATIC_INLINE uint32_t usb_getcoreintr(LL_USB_TypeDef *USBx)
{
    uint32_t v;
    v  = READ_REG32(USBx->GREGS->GINTSTS);
    v &= READ_REG32(USBx->GREGS->GINTMSK);
    return v;
}

/**
 * @brief  Get the out endpoint interrupt bits from the all endpoint interrupt
 *         register not including the bits masked.
 * @param  [in] USBx        usb instance
 * @retval The status that shows which OUT EP have interrupted.
 */
__STATIC_INLINE uint32_t usb_getalloepintr(LL_USB_TypeDef *USBx)
{
    uint32_t v;
    v  = READ_REG32(USBx->DREGS->DAINT);
    v &= READ_REG32(USBx->DREGS->DAINTMSK);
    return ((v & 0xFFFF0000UL) >> 16U);
}

/**
 * @brief  Get the Device OUT EP Interrupt register(DOEPINT) not including the
 *         interrupt bits that are masked.
 * @param  [in] USBx        usb instance
 * @param  [in] epnum       end point index
 * @retval all the interrupt bits on DOEPINTn while n = epnum
 */
__STATIC_INLINE uint32_t usb_getoepintbit(LL_USB_TypeDef *USBx, uint8_t epnum)
{
    uint32_t v;
    v  = READ_REG32(USBx->OUTEP_REGS[epnum]->DOEPINT);
    v &= READ_REG32(USBx->DREGS->DOEPMSK);
    return v;
}

/**
 * @brief  Get the IN endpoint interrupt bits from the all endpoint interrupt
 *         register not including the bits masked.
 * @param  [in] USBx        usb instance
 * @retval The status that shows which IN EP have interrupted.
 */
__STATIC_INLINE uint32_t usb_getalliepintr(LL_USB_TypeDef *USBx)
{
    uint32_t v;
    v  = READ_REG32(USBx->DREGS->DAINT);
    v &= READ_REG32(USBx->DREGS->DAINTMSK);
    return (v & 0xFFFFUL);
}

/**
 * @brief  Set the device a new address.
 * @param  [in] USBx        usb instance
 * @param  [in] address     device address which will be set to the corresponding register.
 * @retval None
 */
__STATIC_INLINE void usb_devaddrset(LL_USB_TypeDef *USBx, uint8_t address)
{
    MODIFY_REG32(USBx->DREGS->DCFG, USBFS_DCFG_DAD, (uint32_t)address << USBFS_DCFG_DAD_POS);
}

/**
 * @brief  Select the USB PHY.
 * @param  [in] USBx        usb instance
 * @param  [in] PhyType      USB phy, 1 select external ULPI PHY, 0 select internal FS PHY
 * @retval None
 */
__STATIC_INLINE void usb_PhySelect(LL_USB_TypeDef *USBx, uint8_t PhyType)
{
    if (1U == PhyType) {
        CLR_REG32_BIT(USBx->GREGS->GUSBCFG, USBFS_GUSBCFG_PHYSEL);
        //SET_REG32_BIT(USBx->GREGS->GUSBCFG, 1UL<<4);  //todo 手册上没有该bit
    } else {
        SET_REG32_BIT(USBx->GREGS->GUSBCFG, USBFS_GUSBCFG_PHYSEL);
    }
}

/**
 * @brief  Select the USB device PHY.
 * @param  [in] USBx        usb instance
 * @param  [in] PhyType      USB phy, 1 select external ULPI PHY, 0 select internal FS PHY
 * @retval None
 */
__STATIC_INLINE void usb_DevPhySelect(LL_USB_TypeDef *USBx, uint8_t PhyType)
{
    if (1U == PhyType) {
        CLR_REG32_BIT(USBx->DREGS->DCFG, USBFS_DCFG_DSPD);
    } else {
        SET_REG32_BIT(USBx->DREGS->DCFG, USBFS_DCFG_DSPD);
    }

